salesforce-minor-mode.org
:PROPERTIES:
:header-args: :shebang ";; -*- no-byte-compile: t; no-native-compile: t -*-"
:END:

#+title:     SALESFORCE-MINOR-MODE
#+author:    tan.nguyen
#+email:     tan.nguyen@furucrm.com

* Config Salesforce Mode
:PROPERTIES:
:header-args+: :tangle salesforce-config.el
:END:
#+begin_src emacs-lisp

  (require 'alert)
  (require 'projectile)
  (require 'subr-x)
  (require 'cl-lib)

  (defcustom sfmm:tangle-on-save t
    "When t, automatically tangle Org files on save."
    :type 'boolean
    :group 'salesforce-minor-mode)

  (defcustom sfmm:api-version nil
    "Custom define api version for command."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:org:list-header-display
    '("username" "instanceUrl" "orgId" "isDevHub" "instanceApiVersion" "alias" "lastUsed" "connectedStatus")
    "Custom define header display on table non scratch orgs"
    :type 'list
    :group 'salesforce-minor-mode)

  (defcustom sfmm:sfdx-lib-alias "sf"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:sfdx-legacy-alias "force"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:project-command-alias "project"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:data-command-alias "data"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:visualforce-command-alias "visualforce"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:apex-command-alias "apex"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:org-command-alias "org"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:lightning-command-alias "lightning"
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:project-deploy-command
    (concat sfmm:project-command-alias " " "deploy")
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:project-retrieve-command
    (concat sfmm:project-command-alias " " "retrieve")
    ""
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:default-browser "qutebrowser"
    "Browser use for open url"
    :type 'string
    :group 'salesforce-minor-mode)

  (defvar-local sfmm:default-apex-trigger-path "force-app/main/default/triggers"
    "Path save apex classes")

  (defvar-local sfmm:default-apex-class-path "force-app/main/default/classes"
    "Path save apex classes")

  (defvar-local sfmm:default-lwc-path "force-app/main/default/lwc"
    "Path save lwc components")

  (defvar-local sfmm:default-aura-path "force-app/main/default/aura"
    "Path save aura components")

  (defvar-local sfmm:default-vf-path "force-app/main/default/pages"
    "Path save visualforce page")

  (defvar-local sfmm:default-vf-components-path "force-app/main/default/components"
    "Path save visualforce page")

  (defvar-local sfmm:default-test-path "force-app/main/default/lightningTests"
    "Path save test components")

  (defvar-local sfmm:package-dir "manifest"
    "Custom define api version for command")

  (defcustom sfmm:org:cache-dir ".cache/"
    "Directory to store cache files."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:dedicated-window-right "*List View*"
    "Name of dedicated window buffer on right."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:tracking-time-format "%Y-%m-%d %H:%M:%S"
    "format of time show on tracking metadata buffer."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:process-buffer "*DX Process*"
    "name of process buffer."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:process-success-buffer "*DX Success*"
    "name of process success buffer."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:process-error-buffer "*DX Error*"
    "name of process error buffer."
    :type 'string
    :group 'salesforce-minor-mode)

  (defcustom sfmm:project-config '()
    "List of config in project
     Ex: ((:project \"test\" :note-file \"org\" ))"
    :type 'list
    :group 'salesforce-minor-mode)

  (defcustom sfmm:org-name ""
    "org name showing on mode line."
    :type 'string)

  (defcustom sfmm:prefix-keymap "M"
    "Prefix for salesforce dx commands."
    :type 'string
    :group 'salesforce-config)

  (defvar-local sfmm:project-root-dir ""
    "Full path project root.")

  (defvar sfmm:mode-line `(if (string-blank-p sfmm:org-name) "salesforce" sfmm:org-name)
    "Salesfoce mode line.")

  (provide 'salesforce-config)
#+end_src
* Internal Salesforce Mode
:PROPERTIES:
:header-args+: :tangle salesforce-helper.el
:END:
** Requirements
#+begin_src emacs-lisp
(require 'salesforce-config)
#+end_src
** Generate command
#+begin_src emacs-lisp
(defun sfmm--internal:generate-command (commands)
  (add-to-list 'commands sfmm:sfdx-lib-alias))

(defun sfmm--internal:build-sf-command (&rest args)
  `(,sfmm:sfdx-lib-alias ,@args))
#+end_src
** Execute apex code
#+begin_src emacs-lisp
(defun sfmm--internal:execute-apex (content)
emacs make-process pipe "Execute code"
  (let ((code (unless content
               (point-min)
               content))
        (temp-file (make-temp-file "temp_code")))

   (write-region (point-min) (point-max) temp-file)
   (setq execute-apex-code-command
     (sfmm--internal:generate-command "apex" "run" "-f" temp-file))

   (async-shell-command execute-apex-code-command buffer)))
#+end_src
*** Excute soql block
#+begin_src emacs-lisp
(cl-defun sfmm--internal:execute-soql (&key query (type 'string) options)
  "Excute command fetch records from Salesforce through api"
  (let* ((options
          (cond ((equal type 'string)
                 (list "--query" query))
                ((equal type 'file)
                 (list "--file" query))))
         (execute-soql-code
          (append (sfmm--internal:generate-command (list sfmm:data-command-alias "query" "--json"))
                  options)))

    (sfmm--internal:make-async-process
     :command execute-soql-code
     :handle-success-lambda
     (lambda (process json-instance buffer)
       
       (when (length= (sfmm--internal:get-data-hashtable "result.records" json-instance) 0)
         (alert "No records found"
                :title "Salesforce Query")
         (error "No records found"))

       (let* ((records-list (sfmm--internal:get-data-hashtable "result.records" json-instance))
              (header-columns (remove-if (lambda (key) (member key '("attributes")))
                                         (hash-table-keys (aref records-list 0))))
              (data (sf--build:make-data-table-from-vector
                     :header-columns header-columns
                     :data records-list)))

         (add-to-list 'header-columns "No")

         (with-current-buffer (pop-to-buffer
                               (sf--build-table:create-table
                                :model
                                (sf--build-table:make-table-mode
                                 :column-header
                                 (cl-loop for key in header-columns
                                          when (not (string= key ""))
                                          collect `(:align ,'left :title ,key `:max-width ,'50))
                                 :data data)
                                :buffer sfmm:dedicated-window-right
                                :open 't))
           (ctbl:table-mode)
           (read-only-mode)))))))
#+end_src

** Synchronous process
+ set readonly for overview buffer, edit the buffer through key-bind
#+begin_src emacs-lisp
(cl-defun sfmm--internal:make-sync-process (&key command handle-success-lambda handle-error-lambda)
  (sfmm--internal:make-process
   :type 'sync
   :command command
   :handle-success-lambda handle-success-lambda
   :handle-error-lambda handle-error-lambda))
#+end_src

** Asynchronous process
#+begin_src elisp
(cl-defun sfmm--internal:make-async-process
    (&key command buffer-name handle-success-lambda handle-error-lambda)
  "Make async process"
  (sfmm--internal:make-process
   :type 'async
   :command command
   :handle-success-lambda handle-success-lambda
   :handle-error-lambda handle-error-lambda))
#+end_src

