salesforce-core.el
;; -*- no-byte-compile: t; no-native-compile: t -*-
(require 'salesforce-config)
