salesforce-helper.el
(require 'salesforce-config)

(defun sfmm--internal:generate-command (commands)
  (add-to-list 'commands sfmm:sfdx-lib-alias))

(defun sfmm--internal:build-sf-command (&rest args)
  `(,sfmm:sfdx-lib-alias ,@args))

(defun sfmm--internal:execute-apex (content)
 emacs make-process pipe "Execute code"
  (let ((code (unless content
               (point-min)
               content))
        (temp-file (make-temp-file "temp_code")))

   (write-region (point-min) (point-max) temp-file)
   (setq execute-apex-code-command
     (sfmm--internal:generate-command "apex" "run" "-f" temp-file))

   (async-shell-command execute-apex-code-command buffer)))

(cl-defun sfmm--internal:execute-soql (&key query (type 'string) options)
  "Excute command fetch records from Salesforce through api"
  (let* ((options
          (cond ((equal type 'string)
                 (list "--query" query))
                ((equal type 'file)
                 (list "--file" query))))
         (execute-soql-code
          (append (sfmm--internal:generate-command (list sfmm:data-command-alias "query" "--json"))
                  options)))

    (sfmm--internal:make-async-process
     :command execute-soql-code
     :handle-success-lambda
     (lambda (process json-instance buffer)
       
       (when (length= (sfmm--internal:get-data-hashtable "result.records" json-instance) 0)
         (alert "No records found"
                :title "Salesforce Query")
         (error "No records found"))

       (let* ((records-list (sfmm--internal:get-data-hashtable "result.records" json-instance))
              (header-columns (remove-if (lambda (key) (member key '("attributes")))
                                         (hash-table-keys (aref records-list 0))))
              (data (sf--build:make-data-table-from-vector
                     :header-columns header-columns
                     :data records-list)))

         (add-to-list 'header-columns "No")

         (with-current-buffer (pop-to-buffer
                               (sf--build-table:create-table
                                :model
                                (sf--build-table:make-table-mode
                                 :column-header
                                 (cl-loop for key in header-columns
                                          when (not (string= key ""))
                                          collect `(:align ,'left :title ,key `:max-width ,'50))
                                 :data data)
                                :buffer sfmm:dedicated-window-right
                                :open 't))
           (ctbl:table-mode)
           (read-only-mode)))))))

(cl-defun sfmm--internal:make-sync-process (&key command handle-success-lambda handle-error-lambda)
  (sfmm--internal:make-process
   :type 'sync
   :command command
   :handle-success-lambda handle-success-lambda
   :handle-error-lambda handle-error-lambda))

(cl-defun sfmm--internal:make-async-process
    (&key command buffer-name handle-success-lambda handle-error-lambda)
  "Make async process"
  (sfmm--internal:make-process
   :type 'async
   :command command
   :handle-success-lambda handle-success-lambda
   :handle-error-lambda handle-error-lambda))

(cl-defun sfmm--internal:make-process
