salesforce-helper.el
    (&key type command handle-success-lambda handle-error-lambda ignore-error)
  ""
  (when (not (member type '(async sync)))
    (error "Invalid type of process"))
  (with-environment-variables (("NODE_NO_WARNINGS" "1"))

    (let* ((process-identity "salesforce")
           (buffer-process (get-buffer-create sfmm:process-buffer))
           (buffer-stdout (get-buffer-create sfmm:process-success-buffer))
           (buffer-stderr (get-buffer-create sfmm:process-error-buffer))
           (process-error (make-pipe-process
                           :name sfmm:process-error-buffer
                           :buffer buffer-stderr
                           :sentinel
                           `(lambda (process event)
                              (unless ,ignore-error
                                (with-current-buffer ,buffer-stderr
                                 (beginning-of-buffer)

                                 (condition-case nil
                                     (json-parse-buffer)
                                   (error (cond ((= (buffer-size) 0)
                                                 nil)
                                                (t
                                                 (alert (replace-regexp-in-string "" "" (buffer-string))
                                                        :title "Salesforce Alert"
                                                        :severity 'urgent)))))
                                 (erase-buffer)))
                              (delete-process process))))
           (process
            (make-process
             :name sfmm:process-success-buffer
             :buffer buffer-process
             :filter
             (lambda (process output)
               (with-current-buffer (get-buffer-create sfmm:process-success-buffer)
                 (insert output)))
             :stderr process-error
             :command command)))

       (pcase type
         ('async
          (set-process-sentinel process
                                `(lambda (process event)
                                  (with-current-buffer (get-buffer-create ,sfmm:process-success-buffer)
                                    (beginning-of-buffer)

                                    (condition-case json-instance
                                        (json-parse-buffer)
                                      (error (cond ((= (buffer-size) 0)
                                                    nil)
                                                   ((not (member "--json" ',command))
                                                    (funcall ,handle-success-lambda process (buffer-string) ,sfmm:process-success-buffer))
                                                   (t
                                                    (alert (buffer-string)
                                                           :title "Salesforce Alert"
                                                           :severity 'urgent))))
                                      (:success
                                          (pcase (cond ((gethash "status" json-instance)
                                                        (gethash "status" json-instance))
                                                       ((gethash "code" json-instance)
                                                        (gethash "status" json-instance)))
                                              (1
                                               (cond (,handle-error-lambda
                                                      (funcall ,handle-error-lambda process json-instance ,sfmm:process-error-buffer))
                                                     (t
                                                      (alert (gethash "message" json-instance)
                                                            :title "Salesforce Alert"
                                                            :severity 'urgent))))
                                              (0
                                               (funcall ,handle-success-lambda process json-instance ,sfmm:process-success-buffer)))))
                                    (erase-buffer)))))
         ('sync
          (when (accept-process-output process))

          (with-current-buffer (get-buffer-create sfmm:process-success-buffer)
            (beginning-of-buffer)

            (let ((data (condition-case json-instance
                            (json-parse-buffer)
                         (error
                          (cond ((= (buffer-size) 0)
                                 nil)
                                ((not (member "--json" command))
                                 (buffer-string))
                                (t
                                 (alert (buffer-string)
                                        :title "Salesforce Alert"
                                        :severity 'urgent)
                                 nil)))
                         (:success
                          (pcase (cond ((gethash "status" json-instance)
                                        (gethash "status" json-instance))
                                       ((gethash "code" json-instance)
                                        (gethash "code" json-instance)))
                            (1
                             (cond (handle-error-lambda
                                    (funcall handle-error-lambda process json-instance sfmm:process-error-buffer)
                                    nil)
                                   (t
                                    (alert (gethash "message" json-instance)
                                           :title "Salesforce Alert"
                                           :severity 'urgent)
                                    nil)))

                            (0
                             json-instance))))))
              (erase-buffer)
              data)))))))

(defun sfmm--internal:execute-command (command message-success)

  (sfmm--internal:make-sync-process
   command
   `(lambda (process output buffer)
      (unless (string= message-success "")
        (alert ,message-success :title "Salesforce Alert")))))

(cl-defun sfmm--internal:execute-async-command
    (&key command (message-success "") (message-failures ""))

  (sfmm--internal:make-async-process
   command
   `(lambda (process output buffer)
      (let* ((json (json-parse-string output))
             (is-success (sfmm--internal:get-data-hashtable "status" json)))

        (if (= is-success 1)
            (unless (string= ,message-success "")
             (alert ,message-success :title "Salesforce Alert"))
          (alert ,message-failures :title "Salesforce Alert"))))))

(cl-defun sfmm--internal:convert-hashtable-data-to-list
    (&key hashtable-data columns (post-process nil))
  "Convert hashtable data to list"
 (let ((data '()))

   (mapcar
      `(lambda (key)
         (when (member key columns)
           (let ((value (gethash key hashtable-data)))

             (when (eq value ':null)
               (setq value " "))
             (when (eq value ':false)
               (setq value "False"))
             (when (eq value 't)
               (setq value "True"))
             (when (eq value 'nil)
               (setq value " "))

             (add-to-list 'data value 1
                          '(lambda (element1 element2) nil))

             (when ,post-process
               (funcall ,post-process key value)))))
      columns)
   data))
