salesforce-minor-mode.org
** Custom map list function
#+begin_src emacs-lisp
(defun sfmm--internal:recursive-list (list-data lambda-function)
  ""
  (let* ((new-list (cdr list-data))
         (first-item (car list-data))
         (remap-list '()))

    (when (length> new-list 0)
        (setq remap-list
              (append remap-list
                      (sfmm--internal:recursive-list new-list lambda-function))))

    (add-to-list 'remap-list (funcall lambda-function first-item))))
#+end_src
** Extract data in hashtable
#+begin_src emacs-lisp
(defun sfmm--internal:get-data-hashtable (path table)
  "Get all data follow the path in hash table"
  (let* ((path-splited (split-string path "\\."))
         (key (car path-splited))
         (value (cond ((arrayp table)
                       (aref table (string-to-number key)))
                      (t
                       (gethash key table))))
         (key-remain (cdr path-splited)))

    (cond (key-remain
           (sfmm--internal:get-data-hashtable
            (string-join key-remain ".")
            value))
          (t
           value))))
#+end_src
** Find root dir
#+begin_src emacs-lisp
(defun sfmm--internal:find-root-dir ()
  (let* ((project (project-current)))
    (cdr project)))
#+end_src

** Build path to file
#+begin_src emacs-lisp
(defun sfmm--internal:build-full-path (&rest args)
  (mapconcat 'identity `(,(sfmm--internal:find-root-dir) ,@args) "/"))
#+end_src
** List salesforce org
#+begin_src emacs-lisp
(defun sfmm--internal:org-alias-list ()
  "Get all alias of orgs."
  (let* ((json-instance (sfmm--internal:make-process
                          :type 'sync
                          :command
                          (sfmm--internal:build-sf-command sfmm:org-command-alias "list" "--json" "--skip-connection-status")))
         (other-org-list (mapcar (lambda (data)
                                     (gethash "alias" data))
                                 (sfmm--internal:get-data-hashtable
                                  "result.other" json-instance)))
         (non-scratch-org-list (mapcar (lambda (data)
                                          (gethash "alias" data))
                                       (sfmm--internal:get-data-hashtable
                                        "result.nonScratchOrgs" json-instance))))
    (append other-org-list non-scratch-org-list)))
#+end_src
** Filter log contents
#+begin_src apex

#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'salesforce-helper)
#+end_src
* Make process
** Make Process
#+begin_src emacs-lisp
  (defun dx-process:process-error-handler
      (process event)
    "Handler process error."
    (with-current-buffer sfmm:process-error-buffer
      (beginning-of-buffer)

      (condition-case nil
          (json-parse-buffer)
        (error (cond ((= (buffer-size) 0)
                      nil)
                     (t
                      (alert (replace-regexp-in-string "" "" (buffer-string))
                             :title "Salesforce Alert"
                             :severity 'urgent)))))))

  (defun dx-process:make
      (cmd type &rest args)
    "Use to make process for all dx command on dx cli.

     `cmd': command want to run use list type.
     `type': type of process, accept value is async or sync.
     OPTION `finish-callback' key: function call after process complete, use for async type and use process result as parameter."
    (when (not (member type '(async sync)))
      (error "Invalid type of process"))

    (let ((dx-process
           :buffer buffer-process
           :filter
           (lambda (process output)
             (with-current-buffer (get-buffer-create sfmm:process-success-buffer)
               (insert output)))
           :stderr (make-pipe-process
                    :name sfmm:process-error-buffer
                    :buffer (get-buffer-create sfmm:process-error-buffer)
                    :sentinel #'dx-process:process-error-handler
                    :command cmd)))

      (pcase type
        ('async
         (set-process-sentinel dx-process
                               `(lambda ()
                                  (funcall ,(plist-get args :finish-callback)
                                           (with-current-buffer (get-buffer-create sfmm:process-success-buffer)
                                             (buffer-string)))))
         ('sync
          (when (accept-process-output dx-process))

          (with-current-buffer (get-buffer-create sfmm:process-success-buffer)
            (buffer-string)))))))

#+end_src

** Handler Jason output
#+begin_src emacs-lisp :tangle yes
  (defmacro dx-process:json-result
      (cmd type success-callback &optional error-callback)
    "Execute dx cli command and return json result."
    `(condition-case nil
         (pcase type
           ('async
            (plist-put args :finish-callback (lambda (content)
                                               (let ((json-instance (json-parse-string content :object-type 'plist)))
                                                 (cond ((or (= (plist-get json-instance :status) 1)
                                                            (= (plist-get json-instance :code) 1))
                                                        ,@success-callback)
                                                       (t ,@error-callback)))))
            (dx-process:make cmd type args))
           ('sync
            (let ((json-instance (json-parse-string (dx-process:make cmd type args) :object-type 'plist)))
              (cond ((or (= (plist-get json-instance :status) 1)
                         (= (plist-get json-instance :code) 1))
                     ,@success-callback)
                    (t ,@error-callback)))
       (json-parse-error (alert "something wrong with josn result."
                                :title "DX Alert"
                                :severity 'urgent))))
#+end_src
** Provide Name
#+begin_src emacs-lisp :tangle yes
  (provide 'dx-process)
#+end_src
* Core Features
:PROPERTIES:
:header-args+: :tangle salesforce-core.el
:END:
** Requirements
#+begin_src emacs-lisp
(require 'salesforce-config)
#+end_src
** SD news
#+begin_src emacs-lisp
(defun sfmm:note:news ()
  "What news on sf cli."
  (interactive)
  (with-current-buffer (pop-to-buffer (get-buffer-create "*sf-note-news*"))
    (delete-selection-mode 1)

    (insert (shell-command-to-string "sf whatsnew"))))
#+end_src
** Project features
*** create project
#+begin_src emacs-lisp
(defun sfmm:project:create ()
  "Create dx project"
  (interactive)
  (let* ((project-path (read-string "project-path: "))
         (package-dir (read-string "package-dir: "))
         (command (sfmm--internal:build-sf-command
                   sfmm:project-command-alias
                   "generate"
                   "--name" project-path
                   "--default-package-dir" package-dir
                   "--json")))

    (make-directory project-path 'parents)

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (let ((project-output (sfmm--internal:get-data-hashtable "result.outputDir" json-instance)))

          (alert "Create Project Success"
                 :title "Salesforce Alert"))))))
#+end_src
** Metadata features
*** push source salesforce to org
#+begin_src emacs-lisp
(defun sfmm:source:push ()
  "Push file to salesforce org."
  (interactive)
  (let* ((file-name buffer-file-name)
         (push-command (sfmm--internal:build-sf-command "force" "source" "deploy" "-p" file-name "--json")))

    (sfmm:org:source-backup)

    (sfmm--internal:make-async-process
     :command `,push-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
       (alert (format "Deploy %s success" ,file-name)
              :title "Salesforce Alert"))
     :handle-error-lambda
     (lambda (process json-instance buffer)
       (let ((show-message "")
             (error-name (gethash "name" json-instance))
             (error-message (gethash "message" json-instance)))

         (cond ((and error-name
                     error-message)
                (setq show-message (format "Name: %s\nMessage: \n%s\n" error-name error-message)))
               (t
                (setq show-message (mapconcat (lambda (component)
                                               (let ((problem (gethash "error" component))
                                                     (problem-type (gethash "problemType" component))
                                                     (line-number (gethash "lineNumber" component))
                                                     (file-name (gethash "filePath" component)))

                                                 (format "Problem-type: %s\nProblem: %s\n%s:%s"
                                                         (gethash "problemType" component)
                                                         (gethash "error" component)
                                                         (gethash "lineNumber" component)
                                                         (gethash "filePath" component))))

                                             (sfmm--internal:get-data-hashtable "result.deployedSource" json-instance)
                                             "\n"))))

         (alert show-message
                :title "Salesforce Alert"
                :category 'error
                :severity 'urgent))))))
#+end_src
*** retrieve source salesforce from org
#+begin_src emacs-lisp
(defun sfmm:source:retrieve
    ()
  "Retrieve source salesforce form org"
  (interactive)
  (let ((retrieve-command (sfmm--internal:build-sf-command "force" "source" "retrieve" "-p" buffer-file-name "--json")))

    (sfmm--internal:make-async-process
     :command retrieve-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (alert (format "Retrieve %s success" ,buffer-file-name)
               :title "Salesforce Alert")))))
#+end_src
