salesforce-core.el

(defun sfmm:note:news ()
  "What news on sf cli."
  (interactive)
  (with-current-buffer (pop-to-buffer (get-buffer-create "*sf-note-news*"))
    (delete-selection-mode 1)

    (insert (shell-command-to-string "sf whatsnew"))))

(defun sfmm:project:create ()
  "Create dx project"
  (interactive)
  (let* ((project-path (read-string "project-path: "))
         (package-dir (read-string "package-dir: "))
         (command (sfmm--internal:build-sf-command
                   sfmm:project-command-alias
                   "generate"
                   "--name" project-path
                   "--default-package-dir" package-dir
                   "--json")))

    (make-directory project-path 'parents)

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (let ((project-output (sfmm--internal:get-data-hashtable "result.outputDir" json-instance)))

          (alert "Create Project Success"
                 :title "Salesforce Alert"))))))

(defun sfmm:source:push ()
  "Push file to salesforce org."
  (interactive)
  (let* ((file-name buffer-file-name)
         (push-command (sfmm--internal:build-sf-command "force" "source" "deploy" "-p" file-name "--json")))

    (sfmm:org:source-backup)

    (sfmm--internal:make-async-process
     :command `,push-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
       (alert (format "Deploy %s success" ,file-name)
              :title "Salesforce Alert"))
     :handle-error-lambda
     (lambda (process json-instance buffer)
       (let ((show-message "")
             (error-name (gethash "name" json-instance))
             (error-message (gethash "message" json-instance)))

         (cond ((and error-name
                     error-message)
                (setq show-message (format "Name: %s\nMessage: \n%s\n" error-name error-message)))
               (t
                (setq show-message (mapconcat (lambda (component)
                                               (let ((problem (gethash "error" component))
                                                     (problem-type (gethash "problemType" component))
                                                     (line-number (gethash "lineNumber" component))
                                                     (file-name (gethash "filePath" component)))

                                                 (format "Problem-type: %s\nProblem: %s\n%s:%s"
                                                         (gethash "problemType" component)
                                                         (gethash "error" component)
                                                         (gethash "lineNumber" component)
                                                         (gethash "filePath" component))))

                                             (sfmm--internal:get-data-hashtable "result.deployedSource" json-instance)
                                             "\n"))))

         (alert show-message
                :title "Salesforce Alert"
                :category 'error
                :severity 'urgent))))))

(defun sfmm:source:retrieve
    ()
  "Retrieve source salesforce form org"
  (interactive)
  (let ((retrieve-command (sfmm--internal:build-sf-command "force" "source" "retrieve" "-p" buffer-file-name "--json")))

    (sfmm--internal:make-async-process
     :command retrieve-command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (alert (format "Retrieve %s success" ,buffer-file-name)
               :title "Salesforce Alert")))))
