salesforce-helper.el

(defun sfmm--internal:recursive-list (list-data lambda-function)
  ""
  (let* ((new-list (cdr list-data))
         (first-item (car list-data))
         (remap-list '()))

    (when (length> new-list 0)
        (setq remap-list
              (append remap-list
                      (sfmm--internal:recursive-list new-list lambda-function))))

    (add-to-list 'remap-list (funcall lambda-function first-item))))

(defun sfmm--internal:get-data-hashtable (path table)
  "Get all data follow the path in hash table"
  (let* ((path-splited (split-string path "\\."))
         (key (car path-splited))
         (value (cond ((arrayp table)
                       (aref table (string-to-number key)))
                      (t
                       (gethash key table))))
         (key-remain (cdr path-splited)))

    (cond (key-remain
           (sfmm--internal:get-data-hashtable
            (string-join key-remain ".")
            value))
          (t
           value))))

(defun sfmm--internal:find-root-dir ()
  (let* ((project (project-current)))
    (cdr project)))

(defun sfmm--internal:build-full-path (&rest args)
  (mapconcat 'identity `(,(sfmm--internal:find-root-dir) ,@args) "/"))

(defun sfmm--internal:org-alias-list ()
  "Get all alias of orgs."
  (let* ((json-instance (sfmm--internal:make-process
                          :type 'sync
                          :command
                          (sfmm--internal:build-sf-command sfmm:org-command-alias "list" "--json" "--skip-connection-status")))
         (other-org-list (mapcar (lambda (data)
                                     (gethash "alias" data))
                                 (sfmm--internal:get-data-hashtable
                                  "result.other" json-instance)))
         (non-scratch-org-list (mapcar (lambda (data)
                                          (gethash "alias" data))
                                       (sfmm--internal:get-data-hashtable
                                        "result.nonScratchOrgs" json-instance))))
    (append other-org-list non-scratch-org-list)))



(provide 'salesforce-helper)
