salesforce-core.el

(cl-defun sfmm:org:source-backup (&key target-org)
  "Backup the current buffer to the source directory."
  (let* ((json-instance nil)
         (buffer (buffer-file-name))
         (file-name (file-name-base buffer))
         (cache-dir (concat (sfmm--internal:find-root-dir)
                            sfmm:org:cache-dir
                            (cond (target-org
                                   target-org)
                                  (t
                                   (sfmm--internal-current-org)))
                            "/"))
         (backup-file-name (concat file-name "_" (format "%s" (time-convert (current-time) 'integer))))
         (command (append (sfmm--internal:build-sf-command sfmm:project-command-alias "retrieve" "start" "-d" buffer "-z" "-t" cache-dir "--zip-file-name" backup-file-name "--json")
                          (when target-org `("-o" ,target-org))))

         (json-instance (progn (unless (file-exists-p cache-dir)
                                 (make-directory cache-dir 'parents))
                               (sfmm--internal:make-process
                                :type 'sync
                                :command command))))
    (unless json-instance
      (error (concat "Backup " file-name " Failure")))
    ;; rename backup directory to new directory containing the last modified id
    ;; and the last modified date
    (let ((new-dir-name (concat cache-dir backup-file-name "_"
                                (sfmm--internal:get-data-hashtable "result.fileProperties.0.lastModifiedById"
                                                                 json-instance)
                                "_"
                                (format "%s"
                                        (time-convert
                                         (date-to-time
                                          (sfmm--internal:get-data-hashtable "result.fileProperties.0.lastModifiedDate"
                                                                           json-instance))
                                         'integer)))))

         (rename-file (concat cache-dir backup-file-name)
                      new-dir-name)
         new-dir-name)))

(defun sfmm:diff:deploy-metadata (branch)
  "Use for deploy diff change between two branches."
  (interactive ("Brach deploy: "))
  (let (sf-command (sfmm--internal:build-sf-command
                    "deploy" "functions" "--connected-org" sfmm:org-name
                    "--branch" branch "--json"))

    (sfmm--internal:make-process
     :type 'async
     :command sf-command
     :handle-success-lambda
     `(lambda (_ json-instance buffer)

        (alert "Deploy metadata success"
               :title "Saleforce Alert")))))

(defun sfmm--ediff-startup-hook ()
  "Ediff hook on startup."
  (let ((coding-system (with-current-buffer ediff-buffer-B
                         buffer-file-coding-system)))

    ;; Set coding for buffer A
    (with-current-buffer ediff-buffer-A
      (set-buffer-file-coding-system coding-system t t))
    (ediff-toggle-read-only ediff-buffer-A)

    (when ediff-buffer-C
      (ediff-toggle-read-only ediff-buffer-C)

      ;; Set coding for buffer C
      (with-current-buffer ediff-buffer-C
        (set-buffer-file-coding-system coding-system t t)))))

(defun sfmm--ediff-quit-hook ()
  "Hook on quit."
 (kill-buffer ediff-buffer-A)
 (when ediff-buffer-C
   (kill-buffer ediff-buffer-C))

 ; Clear hooks
 (remove-hook 'ediff-startup-hook #'sfmm--ediff-startup-hook)
 (remove-hook 'ediff-quit-hook #'sfmm--ediff-quit-hook))

(defun sfmm:diff-metadata ()
  "diff metadata between local and cloud."
  (interactive)
  (let ((file-name (buffer-file-name))
        (backup-file-name (sfmm:org:source-backup)))

    (condition-case error
        (ediff (car (directory-files-recursively (concat backup-file-name "/") (file-name-nondirectory file-name))) file-name
               '((lambda ()
                  (add-hook 'ediff-startup-hook #'sfmm--ediff-startup-hook)
                  (add-hook 'ediff-quit-hook #'sfmm--ediff-quit-hook))))


     (error
      (alert error
             :title "Salesforce Alert"
             :severity 'urgent)))))

(defun sfmm:diff3-metadata ()
  "diff metadata between multiple enviroment."
  (interactive)
  (let* ((minibuffer-history (sfmm--internal:org-alias-list))
         (file-name (buffer-file-name))
         (target-org (read-from-minibuffer "Target Org: "))
         (bk-file-org (sfmm:org:source-backup))
         (bk-file-target-org (sfmm:org:source-backup
                              :target-org target-org)))

    (condition-case error
        (ediff3 (car (directory-files-recursively (concat bk-file-org "/") (file-name-nondirectory file-name))) file-name (car (directory-files-recursively (concat bk-file-target-org "/") (file-name-nondirectory file-name)))
                '((lambda ())
                  (add-hook 'ediff-startup-hook #'sfmm--ediff-startup-hook)
                  (add-hook 'ediff-quit-hook #'sfmm--ediff-quit-hook)))
      (error
       (alert error
              :title "Salesforce Alert"
              :severity 'urgent)))))

(defun sfmm:source-tracker ()
  (interactive)
