salesforce-minor-mode.org
**** track source code
#+begin_src emacs-lisp
(defun sfmm:source-tracker ()
  (interactive)
  (let* ((folder-name (file-name-base buffer-file-name))
         (file-name (file-name-nondirectory buffer-file-name))
         (sfmm:dedicated-window-right "*Org Tracker*")
         (folder-path (expand-file-name
                       (format "%s*/**/%s"
                              (concat (cdr (project-current))
                                      sfmm:org:cache-dir
                                      (sfmm--internal-current-org)
                                      "/"
                                      folder-name)
                              file-name)))
         (model
          (sf--build-table:make-table-mode
           :column-header
           `((:title "Backup DateTime")
             (:title "User Modified Id")
             (:title "Last Modified DateTime"))
           :data
           (remove 'nil
                   (mapcar (lambda (folder)
                            ;; format files show on buffer
                            (when-let* ((columns (string-split folder " "))
                                        (date-time (format-time-string "%Y/%m/%d %H:%M:%S" (string-to-number (nth 0 columns))))
                                        (user-id (nth 1 columns))
                                        (last-modified-date (format-time-string "%Y/%m/%d %H:%M:%S" (string-to-number (nth 2 columns)))))

                              `(,date-time ,user-id ,last-modified-date ,(concat (nth 3 columns) "_" (nth 0 columns) "_" user-id "_" (nth 2 columns)))))
                          ;; list of file names
                          (split-string (shell-command-to-string
                                         ;; script list all files with name
                                         (concat "ls " folder-path " -ta"
                                                 " | " "sed -E 's/.+\\/([a-zA-Z]+)\\_([[:digit:]]+)\\_([A-Za-z0-9]+)\\_([[:digit:]]+)\\/.+$/\\2 \\3 \\4 \\1/'"))
                                        "\n")))))
         (component
          (sf--build-table:create-table
           :model model
           :buffer sfmm:dedicated-window-right)))

    (ctbl:cp-add-click-hook component
                            `(lambda ()
                              (when-let* ((data (ctbl:cp-get-selected-data-row ,component))
                                          (cache-dir (concat (cdr (project-current))
                                                             sfmm:org:cache-dir
                                                             sfmm:org-name
                                                             "/"
                                                             (nth 3 data))))
                                (ediff (car (directory-files-recursively cache-dir ,file-name))
                                       ,buffer-file-name
                                       '((lambda ()
                                           (add-hook 'ediff-startup-hook #'sfmm--ediff-startup-hook)
                                           (add-hook 'ediff-quit-hook #'sfmm--ediff-quit-hook)))))))

    (pop-to-buffer (ctbl:cp-get-buffer component))))
#+end_src

** Org features
*** open org within ctable
#+begin_src emacs-lisp
(defun sfmm:org:specific-open ()
   "Use a specific user name to open org"
   (interactive)
   (let ((user-name (ctbl:cp-get-selected-data-cell (ctbl:cp-get-component))))

     (unless user-name
       (setq user-name (read-string "user-name: ")))

     (sfmm--internal:make-sync-process
      :command
      (sfmm--internal:generate-command (list "org" "open" "--json" "-o" user-name "-r"))
      :handle-success-lambda
      (lambda (process json-instance buffer)
        (let ((url (sfmm--internal:get-data-hashtable "result.url" json-instance)))

          (shell-command (format "%s --target %s %S"
                                 sfmm:default-browser
                                 "tab"
                                 url)))))))
#+end_src

*** open org project
#+begin_src emacs-lisp
(defun sfmm:org:default-open ()
   "Open default org"
   (interactive)
   (let ((command (sfmm--internal:generate-command (list "org" "open" "--json" "-r"))))

     (sfmm--internal:make-async-process
      :command command
      :handle-success-lambda
      (lambda (process json-instance buffer)
        (let ((url (sfmm--internal:get-data-hashtable "result.url" json-instance)))

          (shell-command (concat sfmm:default-browser (format " %S " url) " -r " " tab ") "*vc-log*"))))))
#+end_src

*** view all connected org
#+begin_src emacs-lisp
(defun sfmm--internal:fetch-all-users-org (org-type)
  "Display all current connect org"
  (sfmm--internal:make-async-process
   :command
   (sfmm--internal:build-sf-command sfmm:org-command-alias "list" "--json")
   :handle-success-lambda
   (lambda (process json-instance buffer)
     (pop-to-buffer
      (sf--build-table:create-table
       :model
       (sf--build-table:make-table-mode
        :column-header
        (mapcar (lambda (column-name)
                  (list :title column-name :align 'left :max-width '50))
                sfmm:org:list-header-display)
        :data
        (mapcar (lambda (data)
                  (mapcar (lambda (column-name)
                            (let ((value (gethash column-name data)))

                              (pcase value
                                (:false "false")
                                (:true  "true")
                                (_ value))))
                          sfmm:org:list-header-display))
                (sfmm--internal:get-data-hashtable
                 (concat "result." org-type) json-instance))))
      :buffer sfmm:dedicated-window-right))))
#+end_src
**** view all orgs
#+begin_src emacs-lisp
(defun sfmm:org:display-all-orgs ()
  (interactive)
  (sfmm--internal:fetch-all-users-org "other"))
#+end_src
**** view all devhubs orgs
#+begin_src emacs-lisp
(defun sfmm:org:display-all-devhubs ()
  (interactive)
  (sfmm--internal:fetch-all-users-org "devhubs"))
#+end_src

*** show org connect status
#+begin_src emacs-lisp
(defun sfmm:org:connect-status ()
  "Check connect status to org"
  (let ((display-org-information-command (sfmm--internal:generate-command (list sfmm:org-command-alias "display" "--json"))))

    (sfmm--internal:make-async-process
     :command display-org-information-command
     :handle-success-lambda
     (lambda (process json-instance buffer)
        (let* ((status (sfmm--internal:get-data-hashtable "result.connectedStatus" json-instance)))
          (when (string= status
                         "RefreshTokenAuthError")
            (alert "Token expired !!" :title "Salesforce Alert")))))))
#+end_src
*** default org
#+begin_src emacs-lisp
;;;###autoload
(cl-defun sfmm--internal-current-org ()
  (let* ((root-dir (sfmm--internal:find-root-dir))
         (config-path (concat root-dir ".sf/config.json"))
         (old-config-path (concat root-dir ".sfdx/sfdx-config.json")))

    ;; Return empty string if config files not exist
    (unless (or (file-exists-p config-path)
                (file-exists-p old-config-path))
      (cl-return ""))

    ;; Return org name var if root-dir not change
    (when (and (string= root-dir sfmm:project-root-dir)
               sfmm:org-name)
        sfmm:org-name)

    (condition-case org-name
        (string-replace "\n" ""
         (shell-command-to-string (concat "[ -f " config-path " ] && grep -Po '(?<=\"target-org\": )\"[^\"]+\"' " config-path " | sed -E 's/\"([^\"]+)\"/\\1/' || grep -Po '(?<=\"defaultusername\": )\"[^\"]+\"' " old-config-path " | sed -E 's/\"([^\"]+)\"/\\1/'")))
      (:success org-name)
      (error
        (sfmm--internal:get-data-hashtable "result.0.value"
                                          (sfmm--internal:make-process
                                           :type 'sync
                                           :command
                                           (sfmm--internal:build-sf-command "config" "get" "target-org" "--json")))))))
#+end_src
** Apex features
