salesforce-minor-mode.org
*** apex logs
#+begin_src emacs-lisp
(defun sfmm:apex:get-all-log ()
  "Get log apex"
  (interactive)
  (let ((command (sfmm--internal:build-sf-command sfmm:apex-command-alias "list" "log" "--json")))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (let* ((records-list (sfmm--internal:get-data-hashtable "result" json-instance))
              (header-columns '("No" "Id" "Browser" "Operation"))
              (data (sf--build:make-data-table-from-vector
                     :header-columns header-columns
                     :data records-list)))

         (pop-to-buffer
          (sf--build-table:create-table
           :model
           (sf--build-table:make-table-mode
            :column-header
            (cl-loop for key in header-columns
                     collect `(:align ,'left :title ,key `:max-width ,'50))
            :data data)
           :buffer sfmm:dedicated-window-right
           :open t)))))))
#+end_src
*** apex log
**** get Log
#+begin_src emacs-lisp
(cl-defun sfmm:apex:get-log (&key log-id number org post-log-handle)
  "Get log apex"
  (sfmm--internal:make-async-process
   :command
   (append
    (sfmm--internal:build-sf-command
     sfmm:apex-command-alias "get" "log" "--json")
    (when org `("-o" ,org))
    (unless (string-empty-p log-id) `("--log-id" ,log-id))
    (unless (null number) `("--number" ,number)))
   :handle-success-lambda
   `(lambda (process json-instance buffer)

      (setq json-result (gethash "result" json-instance))
      (funcall ,post-log-handle (gethash "log" (aref json-result 0))))))
#+end_src
**** get filter log
#+begin_src emacs-lisp :tangle no
(cl-defun sfmm:log:get-filter-log ()
  "Get log with filter condition"
  (interactive)
  (let ((filter-type (read-string "Filter: "))
        (log-id-or-number-log (read-string "Log id or number log: "))
        (org (read-string "read-string")))))

#+end_src
*** apex log tail
#+begin_src emacs-lisp
(cl-defun sfmm:apex:log-tail
    (&key (buffer-name "*apex-trace-log*") (org-id nil))
  :interactive
  (let (command (sfmm--internal:generate-command (list sfmm:apex-command-alias "get" "tail" "log" "--json")))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process output)
         (let ((buffer (get-buffer-create ,buffer-name)))
           (with-current-buffer buffer
             (goto-char (point-max))
             (insert output)))))))
#+end_src
*** execute apex code
#+begin_src emacs-lisp
(defun sfmm:execute-apex-code ()
 (interactive)
 (sfmm--internal:execute-apex (point-min)))
#+end_src
** Change org connection
#+begin_src emacs-lisp
(defun sfmm:org:change ()
   (interactive)
   (let* ((minibuffer-history (sfmm--internal:org-alias-list))
          (org-list-json (sfmm--internal:make-process
                          :type 'sync
                          :command
                          (sfmm--internal:build-sf-command sfmm:org-command-alias "list" "--json" "--skip-connection-status")))
          (switch-org (read-from-minibuffer "org-name: " nil nil nil nil sfmm:org-name))
          (json-instance (sfmm--internal:make-process
                          :type 'sync
                          :command (sfmm--internal:build-sf-command "config" "set" "target-org" switch-org  "--json")))
          (org-name (sfmm--internal:get-data-hashtable "result.successes.0.value" json-instance)))

     (setq sfmm:org-name org-name)
     (alert (format "Change to %s success" org-name) :title "Salesforce Alert")))
#+end_src
** Login features
#+begin_src emacs-lisp
  (defun sfmm--internal:org:login (url)
    "Authorize to `url' salesforce org."
    (let* ((alias (read-string "alias: "))
           (authorize-command
            (sfmm--internal:build-sf-command sfmm:org-command-alias "login" "web" "-a" alias "--instance-url" url "--set-default" "--json")))

      (sfmm--internal:make-async-process
       :command
       authorize-command
       :handle-success-lambda
       (lambda (process json-instance buffer)
         (let ((user-name (sfmm--internal:get-data-hashtable "result.username" json-instance)))
           (alert "Authorize success" :title "Salesforce Alert"))))))
#+end_src
*** scratch/Sanbox org
#+begin_src emacs-lisp
(defun sfmm:org:authorize-sandbox ()
  "Authorize use for scratch org and sanbox org"
  (interactive)
  (let* ((url "https://test.salesforce.com"))

    (sfmm--internal:org:login url)))
#+end_src
*** production/Dev org
#+begin_src emacs-lisp
(defun sfmm:org:authorize-production ()
  "Authorize use for dev org and production org"
  (interactive)
  (let* ((url "https://login.salesforce.com"))

    (sfmm--internal:org:login url)))
#+end_src

*** custom instance url org
#+begin_src emacs-lisp
(defun sfmm:org:authorize-custom-url ()
  "Authorize use custom instance url for org"
  (interactive)
  (let* ((url (read-string "url: ")))

    (sfmm--internal:org:login url)))
#+end_src

** SOQL features
*** SOQL key map list view buffer
*** execute soql string
- <2023-12-23 Sat> : code can read history, then pass to read-minibuffer, but need check history file exist and update history back to file.
#+begin_src emacs-lisp
(defun sfmm:soql:string ()
  "Fetch salesforce record by calling API through Salesforce CLI library"
  (interactive)
  (let* ((cache-dir (concat (sfmm--internal:find-root-dir) sfmm:org:cache-dir))
         ;; config local hook for minibuffer
         (minibuffer-history '())
         (minibuffer-mode-hook '((lambda ()
                                   (soql-ts-mode))))
         (max-mini-window-height 5)

         (soql-string (read-from-minibuffer "" nil nil nil nil)))

    (unless (file-exists-p cache-dir)
      (make-directory cache-dir))

    (sfmm--internal:execute-soql :query soql-string)))
#+end_src
**** TODO SOQL file
#+begin_src emacs-lisp
(defun sfmm:fetch-record-through-file ()
  "Fetch record through file."
  (interactive)
  (let ((soql-file (read-from-minibuffer "SOQL-File: ")))

    (sfmm--internal:execute-soql :file soql-file)))
#+end_src
**** query site list
#+begin_src emacs-lisp
(defun sfmm:site:list ()
  ""
  (interactive)
  (sfmm--internal:execute-soql
   :query "SELECT PathPrefix, Domain.Domain, Domain.HttpsOption, Site.Status, Site.SiteType FROM DomainSite"))
#+end_src
*** Compare local file with org file
#+begin_src emacs-lisp
(defun sfmm:fetch-salesforce-file
    ()
  "Retrieve org file from salesforce"
  (let* ((local-path (expand-file-name "~/.cache/sfdx"))
         ())

    ))
#+end_src
*** metadata features
**** visualforce page
#+begin_src emacs-lisp
(defun sfmm:visualforce:generate-page ()
  (interactive)
  (let* ((page-name (read-string "page name: "))
         (page-label (read-string "page label: "))
         (command (sfmm--internal:build-sf-command sfmm:visualforce-command-alias "generate" "page" "--json" "--name" page-name "--label" page-label "--output-dir" (sfmm--internal:build-full-path sfmm:default-vf-path))))

    (sfmm--internal:make-sync-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        ;; Swtich new page
        (switch-to-buffer ,(find-file (concat (sfmm--internal:build-full-path sfmm:default-vf-path) "/" page-name ".page")))

        (alert (format "Create visualforce page" ,page-name)
               :title "Salesforce Alert")))))
#+end_src
**** Visualforce Component
#+begin_src emacs-lisp
(defun sfmm:visualforce:generate-component ()
  (interactive)
  (let* ((page-name (read-string "page name: "))
         (page-label (read-string "page label: "))
         (command (sfmm--internal:generate-command
                   (list sfmm:visualforce-command-alias "generate" "component" "--json" "--name" page-name "--label" page-label "--output-dir" (sfmm--internal:build-full-path sfmm:default-vf-components-path)))))

    (sfmm--internal:make-sync-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)

        (alert (format "Create visualforce page" ,page-name)
               :title "Salesforce Alert")))))
#+end_src
