salesforce-core.el
         (sobject-name (read-string "sobject name: "))
         (events-name (read-string "event name: "))
         (command (sfmm--internal:build-sf-command
                   sfmm:apex-command-alias "generate" "trigger" "--name" class-name "--output-dir" (sfmm--internal:build-full-path sfmm:default-apex-trigger-path) "--json"))
         (class-expand ""))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (let ((full-path-file ,(concat (sfmm--internal:build-full-path sfmm:default-apex-trigger-path) "/" class-name ".trigger")))
          (with-current-buffer (find-file full-path-file)
            (when ,sobject-name
                (replace-string "SOBJECT" ,sobject-name))
            (when ,events-name
                (replace-string "beforce insert" ,events-name))))))))

(defun sfmm:apex:generate-class ()
  "Generate apex class"
  (interactive)
  (let* ((class-name (read-string "class name: "))
         (class-extend (read-string "class parent: "))
         (class-implements (read-string "class implements: "))
         (command (sfmm--internal:build-sf-command
                   sfmm:apex-command-alias "generate" "class" "--name" class-name "--output-dir" (sfmm--internal:build-full-path sfmm:default-apex-class-path) "--json"))
         (class-expand ""))

    (progn
      (unless (string= class-extend "")
        (setq class-expand (concat class-expand "extends" " " class-extend " ")))
      (unless (string= class-implements "")
        (setq class-expand (concat class-expand "implements" " " class-implements " "))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (switch-to-buffer ,(find-file (concat (sfmm--internal:build-full-path sfmm:default-apex-class-path) "/" class-name ".cls")))

        (goto-char (- (point-at-eol) 1))
        (insert ,class-expand)))))

(defun sfmm:apex:generate-test-class ()
  "Generate apex test class"
  (interactive)
  (let* ((class-name (read-string "class name: "))
         (command (sfmm--internal:generate-command
                   (list sfmm:apex-command-alias "generate" "class" "--name" class-name "--output-dir" (sfmm--internal:build-full-path sfmm:default-apex-class-path) "--json"))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (let ((full-path-file ,(concat (sfmm--internal:build-full-path sfmm:default-apex-class-path) "/" class-name ".cls")))
          (org-open-file full-path-file)

          (insert "@isTest"))))))

(defun sfmm:apex:generate-test-method ()
  "Generate apex test method"
  (interactive)
  (let ((method-name (read-string "method name: ")))

    (end-of-buffer)
    (forward-line -1)
    (insert (format "\n%s\nprivate static void %s () {\n}"
                    "@isTest"
                    method-name))))

(cl-defun sfmm:lightning:generate
    (&key type output-dir message-success component-type)
  ""
  (let* ((component-name (read-string "lwc name: "))
         (command (sfmm--internal:generate-command
                    (list sfmm:lightning-command-alias "generate" "component" "--output-dir" output-dir "--name" component-name "--json"))))

    (when (string= type "component")
      (setq command
            (append command (list "--type" component-type))))

    (sfmm--internal:make-sync-process
     :command command
     :handle-success-lambda
     `(lambda (process json-instance buffer)
        (alert (format message-success ,component-name)
               :title "Salesforce Alert")))))

(defun sfmm:lightning-component:generate-lwc ()
  ""
  (interactive)
  (sfmm:lightning:generate
   :type "component"
   :output-dir (sfmm--internal:build-full-path sfmm:default-lwc-path)
   :message-success "Create %s success"
   :component-type "lwc"))

(defun sfmm:lightning-component:generate-aura ()
  "Generate Aura Component"
  (interactive)
  (sfmm:lightning:generate
   :type "component"
   :output-dir (sfmm--internal:build-full-path sfmm:default-aura-path)
   :message-success "Create aura component %s success"
   :component-type "aura"))

(defun sfmm:lightning-app:generate ()
  "Create lightning app"
  (interactive)
  (sfmm:lightning:generate
   :type "app"
   :output-dir (sfmm--internal:build-full-path sfmm:default-aura-path)
   :message-success "Create app %s sucesss"))

(defun sfmm:lightning-event:generate ()
  "Create lightning event"
  (interactive)
  (sfmm:lightning:generate
   :type "event"
   :output-dir (sfmm--internal:build-full-path sfmm:default-aura-path)))

(defun sfmm:lightning-interface:generate ()
  "Create lightning interface"
  (interactive)
  (sfmm:lightning:generate
   :type "interface"
   :output-dir (sfmm--internal:build-full-path sfmm:default-aura-path)
   :message-success "Create interface %s success"))

(defun sfmm:lightning-test:generate ()
  "Create lightning test"
  (interactive)
  (sfmm:lightning:generate
   :type "test"
   :output-dir (sfmm--internal:build-full-path sfmm:default-test-path)
   :message-success "Create test %s sucess"))

(cl-defun sfmm:apex:get-result-test-job
    (&key job-id)
  "Get result tests"
  (sfmm--internal:make-async-process
   :command
   (sfmm--internal:build-sf-command sfmm:apex-command-alias "get" "test" "-i" job-id "--json")
   :handle-success-lambda
   (lambda (process json-instance buffer)
     (let ((result-tests
            (mapconcat (lambda (result-test)
                         (let ((stack-trace (gethash "StackTrace" result-test))
                               (outcome (gethash "Outcome" result-test))
                               (error-message (gethash "Message" result-test))
                               (method-name (gethash "MethodName" result-test))
                               (class-name-test (sfmm--internal:get-data-hashtable "ApexClass.Name" result-test)))

                           (format "Class: %s\nMethod: %s\nResult: %s\n%s"
                                   class-name-test
                                   method-name
                                   (cond ((equal error-message ':null)
                                          outcome)
                                         (error-message
                                          error-message))
                                   (cond ((equal stack-trace ':null)
                                          "")
                                         (stack-trace
                                          stack-trace)))))

                       (sfmm--internal:get-data-hashtable "result.tests" json-instance)
                       "\n")))
       (alert result-tests
              :title "Salesforce Alert")))))

(defun sfmm:apex:run-test-class ()
  "Run unit test for class"
  (interactive)
  (sfmm--internal:make-async-process
   :command
   (sfmm--internal:generate-command sfmm:apex-command-alias "run" "test" "--tests" (file-name-base) "--test-level" "RunSpecifiedTests" "--json")
   :handle-success-lambda
   (lambda (process json-instance buffer)
     (alert "Class tests run success"
            :title "Salesforce Alert")

     (sfmm:apex:get-result-test-job
      :job-id (sfmm--internal:get-data-hashtable "result.testRunId" json-instance)))))
