salesforce-minor-mode.org
**** run local test classes
#+begin_src emacs-lisp
(defun sfmm:apex:run-local-tests ()
  "Run all tests class expect tests class in org managed package"
  (interactive)
  (let ((command (sfmm--internal:generate-command (list sfmm:apex-command-alias "run" "test" "--test-level" "RunLocalTests" "--json"))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (sfmm:apex:get-result-test-job (job-id (sfmm--internal:get-data-hashtable "result.testRunId" json-instance)))))))
#+end_src
**** [ ] run specific unit test
#+begin_src emacs-lisp

#+end_src
*** RUN LWC LOCAL SERVER
#+begin_src emacs-lisp
(defun sfmm:server:local-lwc ()
  ""
  (interactive)
  (let ((command (sfmm--internal:generate-command (list sfmm:sfdx-legacy-alias "lightning" "lwc" "start" "--json"))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-string buffer)
        (alert "Start lwc local server success"
               :title "Salesforce Alert")))))
#+end_src

** Clear log
#+begin_src emacs-lisp
(defun sfmm:org:clear-log ()
  "clear all apex log on org."
  (interactive)
  (let ((temp-file (make-temp-file "log" nil ".csv"))
        (data (sfmm--internal:make-process
               :ignore-error t
               :type 'sync
               :command
               (sfmm--internal:build-sf-command
                sfmm:data-command-alias "query" "--query" "SELECT Id FROM ApexLog" "-t" "-r" "csv"))))

    (with-temp-file temp-file
      (when data
        (insert data)))

    (sfmm--internal:make-async-process
     :command
     (sfmm--internal:build-sf-command
      sfmm:data-command-alias "delete" "bulk" "--sobject" "ApexLog" "--file" temp-file "--json")
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (alert "clear log success"
              :title "Success")))))
#+end_src

** Project note
#+begin_src emacs-lisp
(defun sfmm:open-project-note ()
  "Open note for current project."
  (interactive)
  (if-let ((note-file (plist-get (cl-find-if (lambda (el)
                                               (string= (expand-file-name (plist-get el :project)) sfmm:project-root-dir))
                                             sfmm:project-config)
                                 :note-file)))

      (display-buffer-in-side-window (find-file-noselect
                                      (expand-file-name note-file))
                                     '((side . right)
                                       (window-width . 0.4)))
    (error "note file not found.")))
#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'salesforce-core)
#+end_src
* CTable build
:PROPERTIES:
:header-args+: :tangle salesforce-ctable.el
:END:
** Requirements
#+begin_src emacs-lisp
(require 'salesforce-config)
(require 'ctable)
#+end_src
** Build table
*** Popup ctable component
#+begin_src emacs-lisp
(cl-defun sf--build-table:create-table (&key model buffer open)
  "use ctable to build table data"
  (let ((component (ctbl:create-table-component-buffer
                    :model model
                    :buffer (get-buffer-create buffer))))
    (if open
      (ctbl:cp-get-buffer component)
     component)))
#+end_src
*** Build ctable component
#+begin_src emacs-lisp
(cl-defun sf--build-table:make-table-mode (&key column-header data)
  "use ctable to build table data"
  (let ((column-model
         (mapcar 'sf--build-table:make-header-model column-header))
        (async-model
         (ctbl:async-model-wrapper data)))

   (make-ctbl:model
    :column-model column-model :data async-model)))
#+end_src
*** Build ctable header
#+begin_src emacs-lisp
(defun sf--build-table:make-header-model (header-config)
  "build header ctable"
  (let* ((title
          (plist-get header-config :title))
         (min-width
          (plist-get header-config :min-width))
         (max-width
          (plist-get header-config :max-width))
         (align
          (plist-get header-config :align)))

    (make-ctbl:cmodel
     :title title
     :sorter 'ctbl:sort-number-lessp
     :min-width min-width
     :max-width max-width
     :align align)))
#+end_src

*** Build ctable data
#+begin_src emacs-lisp
(cl-defun sf--build:make-data-table-from-vector
    (&key header-columns data (enable-count-rows t))
  "build data from input hash table and header-columns"
  (let ((data-table ()))
    (cl-loop for item in data
             for col in header-columns
             collect `())
    (dotimes (i (length data))
      (let ((row (append (list (+ i 1))
                         (mapcar `(lambda (key)
                                    (let ((value (gethash key ,(aref data i))))

                                      (if (hash-table-p value)
                                          (gethash "url" value)
                                        (cond ((eq value ':null)
                                               "")
                                              ((eq value ':false)
                                               "False")
                                              ((eq value 't)
                                               "True")
                                              (t
                                               value)))))

                                 header-columns))))
        (add-to-list 'data-table row 1 '(lambda (v1 v2)
                                             nil))))
    data-table))
#+end_src
** Package name
#+begin_src emacs-lisp
(provide 'salesforce-ctable)
#+end_src
* Minor Mode
:PROPERTIES:
:header-args+: :tangle salesforce-minor-mode.el
:END:
** Requirements
Libraries use in package
#+begin_src emacs-lisp
;;; Salesforce minor mode -- add sf cli to emacs
(require 'salesforce-config)
(require 'salesforce-helper)
(require 'salesforce-ctable)
(require 'salesforce-core)
#+end_src
** Key map
Default key map for minor mode
|-------+----------------------------+-------------------------------------------------------------|
| Key   | Function                   | Description                                                 |
|-------+----------------------------+-------------------------------------------------------------|
| M-o s | sfmm:org:authorize-sandbox | Authorize to org sandbox have host is `test.salesforce.com` |
|       |                            |                                                             |
#+begin_src emacs-lisp
  (defvar salesforce-mode-map
    (let ((map (make-sparse-keymap)))
      ;; org features
      (keymap-set map "M-o s" (cons "Authorize Sandbox" #'sfmm:org:authorize-sandbox))
      (keymap-set map "M-o p" (cons "Authorize Production" #'sfmm:org:authorize-production))
      (keymap-set map "M-o c" (cons "Authorize URL" #'sfmm:org:authorize-cusom-url))
      (keymap-set map "M-o c" (cons "Switch Org" #'sfmm:org:change))

      (keymap-set map "M-o r" (cons "Retrieve Metadata" #'sfmm:source:retrieve))
      (keymap-set map "M-o d" (cons "Deploy Metadata" #'sfmm:source:push))

      (keymap-set map "M-o o" (cons "Open Org" #'sfmm:org:default-open))
      (keymap-set map "M-o n" (cons "View All Orgs" #'sfmm:org:display-all-orgs))
      (keymap-set map "M-o m" (cons "View All Devhubs" #'sfmm:org:display-all-devhubs))
      (keymap-set map "M-o N" (cons "Notes" #'sfmm:open-project-note))

      ;; log features
      (keymap-set map "M-o l" (cons "Clear Log" #'sfmm:org:clear-log))

      ;; apex features
      (keymap-set map "M-c t" (cons "Create Trigger" #'sfmm:apex:generate-trigger))
      (keymap-set map "M-c c" (cons "Create Apex Class" #'sfmm:apex:generate-class))
      (keymap-set map "M-c T" (cons "Create Apex Class Test" #'sfmm:apex:generate-test-class))
      (keymap-set map "M-c F" (cons "Create Method Test" #'sfmm:apex:generate-test-method))
      ;; project features
      (keymap-set map "M-q t" (cons "Query Record" #'sfmm:soql:string))
      ;; (keymap-set map "M-q f" (cons "Ex" #'sfmm:fetch-salesforce-file))

      ;; visualforce features
      (keymap-set map "M-c v" (cons "Create Visualforce Page" #'sfmm:visualforce:generate-page))
      (keymap-set map "M-c C" (cons "Create Visualforce Component" #'sfmm:visualforce:generate-component))

      ;; metadata features
      (keymap-set map "M-m t" (cons "Source Tracker" #'sfmm:source-tracker))
      (keymap-set map "M-m d" (cons "Diff Source" #'sfmm:diff-metadata))
      (keymap-set map "M-m D" (cons "Diff Source Multi Org" #'sfmm:diff3-metadata))
      map)
    "Keymap for `salesforce-minor-mode'.")
#+end_src

** Hook functions
#+begin_src emacs-lisp
;;;###autoload
(defun turn-on-salesforce-mode ()
  "turn on salesforce-minor-mode"
  (salesforce-minor-mode 1))

;;;###autoload
(defun turn-off-salesforce-mode ()
  "turn on salesforce-minor-mode"
  (salesforce-minor-mode -1))
#+end_src
** Config mode line
#+begin_src emacs-lisp
  (defun salesforce-minor-mode--init ()
    "Initialize mode."
    (setq-default sfmm:org-name (sfmm--internal-current-org)
                  sfmm:project-root-dir (sfmm--internal:find-root-dir)))
#+end_src
** Define minor mode
#+begin_src emacs-lisp
  ;;;###autoload
  (define-minor-mode salesforce-minor-mode
    "Toggles global salesforce minor mode."
    nil ; Inital value, nil for disabled
    :global nil
    :group 'salesforce
    :keymap salesforce-mode-map

    (if salesforce-minor-mode
        (add-hook 'salesforce-minor-mode-hook #'salesforce-minor-mode--init)
      (remove-hook 'salesforce-minor-mode-hook #'salesforce-minor-mode--init)))

  (provide 'salesforce-minor-mode) ;;; salesforce-minor-mode end here.
#+end_src
