salesforce-core.el

(defun sfmm:apex:run-local-tests ()
  "Run all tests class expect tests class in org managed package"
  (interactive)
  (let ((command (sfmm--internal:generate-command (list sfmm:apex-command-alias "run" "test" "--test-level" "RunLocalTests" "--json"))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (sfmm:apex:get-result-test-job (job-id (sfmm--internal:get-data-hashtable "result.testRunId" json-instance)))))))



(defun sfmm:server:local-lwc ()
  ""
  (interactive)
  (let ((command (sfmm--internal:generate-command (list sfmm:sfdx-legacy-alias "lightning" "lwc" "start" "--json"))))

    (sfmm--internal:make-async-process
     :command command
     :handle-success-lambda
     `(lambda (process json-string buffer)
        (alert "Start lwc local server success"
               :title "Salesforce Alert")))))

(defun sfmm:org:clear-log ()
  "clear all apex log on org."
  (interactive)
  (let ((temp-file (make-temp-file "log" nil ".csv"))
        (data (sfmm--internal:make-process
               :ignore-error t
               :type 'sync
               :command
               (sfmm--internal:build-sf-command
                sfmm:data-command-alias "query" "--query" "SELECT Id FROM ApexLog" "-t" "-r" "csv"))))

    (with-temp-file temp-file
      (when data
        (insert data)))

    (sfmm--internal:make-async-process
     :command
     (sfmm--internal:build-sf-command
      sfmm:data-command-alias "delete" "bulk" "--sobject" "ApexLog" "--file" temp-file "--json")
     :handle-success-lambda
     (lambda (process json-instance buffer)
       (alert "clear log success"
              :title "Success")))))

(defun sfmm:open-project-note ()
  "Open note for current project."
  (interactive)
  (if-let ((note-file (plist-get (cl-find-if (lambda (el)
                                               (string= (expand-file-name (plist-get el :project)) sfmm:project-root-dir))
                                             sfmm:project-config)
                                 :note-file)))

      (display-buffer-in-side-window (find-file-noselect
                                      (expand-file-name note-file))
                                     '((side . right)
                                       (window-width . 0.4)))
    (error "note file not found.")))

(provide 'salesforce-core)
